import styles from './About.module.css';

export const aboutParagraphs = [
  <>
    Меня зовут <span className={styles.highlight}>Станислав Борисенко</span>, я
    React Frontend разработчик. Создаю современные веб-приложения с чистым
    кодом, продуманным интерфейсом и высокой производительностью.
  </>,
  <>
    Я закончил Пятигорский Государственный Университет по специальности{' '}
    <span className={styles.highlight}>"Информационная безопасность"</span>{' '}
    (бакалавр) и продолжаю обучение на магистратуре по той же специальности.
    Выбрал Frontend, потому что мне нравится создавать интерфейсы, которые
    удобно использовать, и видеть мгновенный результат своей работы.
  </>,
  <>
    В работе использую современный стек:
    <span className={styles.highlight}>
      {' '}
      TypeScript, React, Redux Toolkit, TanStack Query, Zustand и React Router
    </span>
    . Стилизую приложения с помощью{' '}
    <span className={styles.highlight}>
      Tailwind CSS, CSS modules и styled-components
    </span>
    . Постоянно совершенствую навыки и слежу за новыми подходами в экосистеме
    React. В будущем планирую стать fullstack-разработчиком.
  </>,
  <>
    Моя цель — создавать интерфейсы, которые не только работают без ошибок, но и
    доставляют удовольствие пользователю. В каждом проекте я стремлюсь к чистоте
    кода, удобству и продуманной архитектуре.
  </>,
  <>
    В свободное время реализую пет-проекты, изучаю новые технологии и
    инструменты, смотрю фильмы и сериалы, играю в игры и занимаюсь спортом.
  </>,
];
